"use client";

const announcement = [
    {
    date: "2025/05/13 - 9:00",
    content: "服务器维护，把广州的电信节点改为南京腾讯云节点，当日上午10:30维护完毕。",
  },
  {
    date: "2025/05/12 - 10:00",
    content: "因喵服用户数上升、开发者资金及人力不足等多方面因素，喵服的联机体验并不太好，可更换其他联机软件（如蒲公英）。喵服要在今年下半年才有时间优化联机体验，谢谢用户的支持。免费纯公益的东西，挺容易炸的。",
  },
  {
    date: "2025/02/13 - 23:00",
    content: "重写喵服使用文档，更新赞助表",
  },
  {
    date: "2025/01/11 - 11:45",
    content: "解决ipv6网络无法检测延迟的问题",
  },
  {
    date: "2025/01/02 - 01:00",
    content:
      "优化检测在线逻辑，提高获取延迟精度，电脑(win)不再需要防火墙放通ping协议以检测在线",
  },
  {
    date: "2024/12/05 - 22:00",
    content: "更新了连接喵服的视频教程，就是怎么离线变在线",
  },
  {
    date: "2024/11/25 - 21:00",
    content: "解决联机高峰期喵服网络卡顿问题",
  },
  {
    date: "2024/11/22 - 21:45",
    content: "如果安卓WG导入conf key报错，请到教程里下载最新的安装包更新",
  },
];

export default announcement;
